

#include <iostream>>
#include <Windows.h>
//#include <Windows.h>
using namespace std;

int main()
{
    setlocale(LC_ALL, "");
    int a;
    cout << "Введите целое положительное число: ";
    cin >> a;
    while (a < 0)
    {
        cout << "Введите целое ПОЛОЖИТЕЛЬНОЕ число: ";
        cin >> a;
    }
    cout << "вы ввели : " << a;

    // Второе задание первого задания
    int x;
    int y;
    cout << "Введите число до 10: " << endl;
    cin >> x;
    int sum = 0;
    for (y = 1; y <= x; y++)
    {
        sum = sum + y;

    }
    cout << " Сумма равна " << sum << endl;
    return 0;

    //Третье, четвертое, пятое,шестое задание первого задания
    int arr[10] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
    for (int i = 0; i < 10; i++)
    {
        cout << arr[i] << " ";
    }
    cout << endl;
    for (int i = 0; i < 10; i++)
    {
        if (i % 2 == 0)
        {
            cout << arr[i] << " ";
        }
    }
    cout << endl;
    for (int i = 0; i < 10; i++)
    {
        if (i % 2 == 1)
        {
            cout << arr[i] << " ";
        }
    }
    cout << endl;
    return 0;

    // ВТОРОЕ ЗАДАНИЕ 
    int b, c;
    cout << "Введите два число: ";
    cin >> b >> c;
    cout << "Вы ввели : " << b << " ," << c << endl;

    cout << "Среднее арифметическое равно : " << ((b + c) / 2) << endl;
    string z;
    cout << "Введите знак операции : " << endl;
    cin >> z;
    if (z == "+")
    {
        cout << b << "+" << c << "=" << (b + c) << endl;
    }
    else if (z == "-")
    {
        cout << b << "-" << c << "=" << (b - c) << endl;
        cout << c << "-" << b << "=" << (c - b) << endl;
    }
    else if (z == "-")
    {
        cout << b << "*" << c << "=" << (b * c) << endl;
    }
    else if (z == "/")
    {
        cout << b << "/" << c << "=" << (b / c) << endl;
        cout << c << "/" << b << "=" << (c / b) << endl;
    }
}



// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
