#include <iostream>
using namespace std;

int func_one(int a = 1)
{
    int Sum;
    if (a > 0) {
        Sum = 0;
        for (int i = 0; i <= a; i++) {
            Sum += 1;
        }
        cout << "Сумма =" << Sum << endl;
    }
    else {
        return 0;
    }
}

void func_two_three(int b, int c, int& d, int& e)
{
    d = b + c;
    e = b * c;
}

int main()
{
    setlocale(LC_ALL, "");
    //Zadanie 1-2
    int sum = 0;
    int arr[2][3] = { {1,2,3},{4,5,6} };
    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 3; j++) {
            sum += arr[i][j];
        }
    }
    cout << sum << endl;
    //Zadanie 2-5
    int Arr[] = { 1,2,3 };
    Arr[0] = arr[0][0] + arr[1][0];
    Arr[1] = arr[0][1] + arr[1][1];
    Arr[2] = arr[0][2] + arr[1][2];
    for (int i = 0; i < 3; i++)
    {
        cout << Arr[i] << " ";
    }
    cout << endl;
    //Zadanie 6-9
    float x = 20.84;
    float& y = x;
    y = 1.5;
    float& z = x;
    z = 2.1;
    cout << "x = " << z << " y = " << y << endl;

    //Zadanie 10
    func_one();
    //Zadanie 12-14
    int b = 9, c = 90;
    int d, e;
    func_two_three(b = 9, c = 90, d, e);
    cout << "Сумма = " << d << endl;
    cout << "Поизведение = " << e << endl;

    //Zadanie 15
    int q = 1;
    cout << q << endl;
    for (int i = 0; i < 3; i++)
    {
        int w = 2;
        cout << q << " " << endl;
        cout << w << " " << endl;
    }

}



// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
