// Lab_2.4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using  std::cout;
using  std::cin;
using  std::endl;
#define SUM(a,b) a+b;


void test(int y) {
    static int x = 0;
    cout << x + y << endl;
    x = y;
}

#include"Header.h"
using namespace CoolG;

int main()
{
    test(1);
    test(2);
    test(3);

    cout << SUM(7, 2);
    cout << endl;

    int q = 4;
    int w = 5;
    int e = 6;
    cout << CoolG::tst(q) << endl;
    cout << CoolG::tst(w) << endl;
    cout << CoolG::tst(e) << endl;
    system("pause");
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
